mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xn/common/mb9bf46xn.h
#define bFM_QPRC1_QECR_ORNGMD                     *((volatile  uint8_t *)(0x424C0B80UL))
#define bFM4_QPRC1_QECR_ORNGMD                    *((volatile  uint8_t *)(0x424C0B80UL))
#define bFM_QPRC1_QECR_ORNGF                      *((volatile  uint8_t *)(0x424C0B84UL))
#define bFM4_QPRC1_QECR_ORNGF                     *((volatile  uint8_t *)(0x424C0B84UL))
#define bFM_QPRC1_QECR_ORNGIE                     *((volatile  uint8_t *)(0x424C0B88UL))
#define bFM4_QPRC1_QECR_ORNGIE                    *((volatile  uint8_t *)(0x424C0B88UL))

#define bFM_QPRC1_QICRH_CDCIE                     *((volatile  uint8_t *)(0x424C0AA0UL))
#define bFM4_QPRC1_QICRH_CDCIE                    *((volatile  uint8_t *)(0x424C0AA0UL))
#define bFM_QPRC1_QICRH_CDCF                      *((volatile  uint8_t *)(0x424C0AA4UL))
#define bFM4_QPRC1_QICRH_CDCF                     *((volatile  uint8_t *)(0x424C0AA4UL))
#define bFM_QPRC1_QICRH_DIRPC                     *((volatile  uint8_t *)(0x424C0AA8UL))
#define bFM4_QPRC1_QICRH_DIRPC                    *((volatile  uint8_t *)(0x424C0AA8UL))
#define bFM_QPRC1_QICRH_DIROU                     *((volatile  uint8_t *)(0x424C0AACUL))
#define bFM4_QPRC1_QICRH_DIROU                    *((volatile  uint8_t *)(0x424C0AACUL))
#define bFM_QPRC1_QICRH_QPCNRCMIE                 *((volatile  uint8_t *)(0x424C0AB0UL))
#define bFM4_QPRC1_QICRH_QPCNRCMIE                *((volatile  uint8_t *)(0x424C0AB0UL))
#define bFM_QPRC1_QICRH_QPCNRCMF                  *((volatile  uint8_t *)(0x424C0AB4UL))
#define bFM4_QPRC1_QICRH_QPCNRCMF                 *((volatile  uint8_t *)(0x424C0AB4UL))

#define bFM_QPRC1_QICRL_QPCMIE                    *((volatile  uint8_t *)(0x424C0A80UL))
#define bFM4_QPRC1_QICRL_QPCMIE                   *((volatile  uint8_t *)(0x424C0A80UL))
#define bFM_QPRC1_QICRL_QPCMF                     *((volatile  uint8_t *)(0x424C0A84UL))
#define bFM4_QPRC1_QICRL_QPCMF                    *((volatile  uint8_t *)(0x424C0A84UL))
#define bFM_QPRC1_QICRL_QPRCMIE                   *((volatile  uint8_t *)(0x424C0A88UL))
#define bFM4_QPRC1_QICRL_QPRCMIE                  *((volatile  uint8_t *)(0x424C0A88UL))
#define bFM_QPRC1_QICRL_QPRCMF                    *((volatile  uint8_t *)(0x424C0A8CUL))
#define bFM4_QPRC1_QICRL_QPRCMF                   *((volatile  uint8_t *)(0x424C0A8CUL))
#define bFM_QPRC1_QICRL_OUZIE                     *((volatile  uint8_t *)(0x424C0A90UL))
#define bFM4_QPRC1_QICRL_OUZIE                    *((volatile  uint8_t *)(0x424C0A90UL))
#define bFM_QPRC1_QICRL_UFDF                      *((volatile  uint8_t *)(0x424C0A94UL))
#define bFM4_QPRC1_QICRL_UFDF                     *((volatile  uint8_t *)(0x424C0A94UL))
#define bFM_QPRC1_QICRL_OFDF                      *((volatile  uint8_t *)(0x424C0A98UL))
#define bFM4_QPRC1_QICRL_OFDF                     *((volatile  uint8_t *)(0x424C0A98UL))
#define bFM_QPRC1_QICRL_ZIIF                      *((volatile  uint8_t *)(0x424C0A9CUL))
#define bFM4_QPRC1_QICRL_ZIIF                     *((volatile  uint8_t *)(0x424C0A9CUL))


/*******************************************************************************
* QPRC_NF Registers QPRC1_NF
*   Bitband Section
*******************************************************************************/
#define bFM_QPRC1_NF_NFCTLA_AINLV                 *((volatile  uint8_t *)(0x424C2210UL))
#define bFM4_QPRC1_NF_NFCTLA_AINLV                *((volatile  uint8_t *)(0x424C2210UL))
#define bFM_QPRC1_NF_NFCTLA_AINMD                 *((volatile  uint8_t *)(0x424C2214UL))
#define bFM4_QPRC1_NF_NFCTLA_AINMD                *((volatile  uint8_t *)(0x424C2214UL))

#define bFM_QPRC1_NF_NFCTLB_BINLV                 *((volatile  uint8_t *)(0x424C2290UL))
#define bFM4_QPRC1_NF_NFCTLB_BINLV                *((volatile  uint8_t *)(0x424C2290UL))
#define bFM_QPRC1_NF_NFCTLB_BINMD                 *((volatile  uint8_t *)(0x424C2294UL))
#define bFM4_QPRC1_NF_NFCTLB_BINMD                *((volatile  uint8_t *)(0x424C2294UL))

#define bFM_QPRC1_NF_NFCTLZ_ZINLV                 *((volatile  uint8_t *)(0x424C2310UL))
#define bFM4_QPRC1_NF_NFCTLZ_ZINLV                *((volatile  uint8_t *)(0x424C2310UL))
#define bFM_QPRC1_NF_NFCTLZ_ZINMD                 *((volatile  uint8_t *)(0x424C2314UL))
#define bFM4_QPRC1_NF_NFCTLZ_ZINMD                *((volatile  uint8_t *)(0x424C2314UL))


/*******************************************************************************
* RTC Registers RTC
*   Bitband Section
*******************************************************************************/
#define bFM_RTC_ALMOR_TAMO                        *((volatile  uint8_t *)(0x42762890UL))
#define bFM4_RTC_ALMOR_TAMO                       *((volatile  uint8_t *)(0x42762890UL))

#define bFM_RTC_EWKUP_WUP0                        *((volatile  uint8_t *)(0x42763180UL))
#define bFM4_RTC_EWKUP_WUP0                       *((volatile  uint8_t *)(0x42763180UL))

#define bFM_RTC_HIBRST_HIBRST                     *((volatile  uint8_t *)(0x42763300UL))
#define bFM4_RTC_HIBRST_HIBRST                    *((volatile  uint8_t *)(0x42763300UL))

#define bFM_RTC_VBDDR_VDDR0                       *((volatile  uint8_t *)(0x42763480UL))
#define bFM4_RTC_VBDDR_VDDR0                      *((volatile  uint8_t *)(0x42763480UL))
#define bFM_RTC_VBDDR_VDDR1                       *((volatile  uint8_t *)(0x42763484UL))
#define bFM4_RTC_VBDDR_VDDR1                      *((volatile  uint8_t *)(0x42763484UL))
#define bFM_RTC_VBDDR_VDDR2                       *((volatile  uint8_t *)(0x42763488UL))
#define bFM4_RTC_VBDDR_VDDR2                      *((volatile  uint8_t *)(0x42763488UL))
#define bFM_RTC_VBDDR_VDDR3                       *((volatile  uint8_t *)(0x4276348CUL))
#define bFM4_RTC_VBDDR_VDDR3                      *((volatile  uint8_t *)(0x4276348CUL))

#define bFM_RTC_VBDIR_VDIR0                       *((volatile  uint8_t *)(0x42763500UL))
#define bFM4_RTC_VBDIR_VDIR0                      *((volatile  uint8_t *)(0x42763500UL))
#define bFM_RTC_VBDIR_VDIR1                       *((volatile  uint8_t *)(0x42763504UL))
#define bFM4_RTC_VBDIR_VDIR1                      *((volatile  uint8_t *)(0x42763504UL))
#define bFM_RTC_VBDIR_VDIR2                       *((volatile  uint8_t *)(0x42763508UL))
#define bFM4_RTC_VBDIR_VDIR2                      *((volatile  uint8_t *)(0x42763508UL))
#define bFM_RTC_VBDIR_VDIR3                       *((volatile  uint8_t *)(0x4276350CUL))
#define bFM4_RTC_VBDIR_VDIR3                      *((volatile  uint8_t *)(0x4276350CUL))

#define bFM_RTC_VBDOR_VDOR0                       *((volatile  uint8_t *)(0x42763580UL))
#define bFM4_RTC_VBDOR_VDOR0                      *((volatile  uint8_t *)(0x42763580UL))
#define bFM_RTC_VBDOR_VDOR1                       *((volatile  uint8_t *)(0x42763584UL))
#define bFM4_RTC_VBDOR_VDOR1                      *((volatile  uint8_t *)(0x42763584UL))
#define bFM_RTC_VBDOR_VDOR2                       *((volatile  uint8_t *)(0x42763588UL))
#define bFM4_RTC_VBDOR_VDOR2                      *((volatile  uint8_t *)(0x42763588UL))
#define bFM_RTC_VBDOR_VDOR3                       *((volatile  uint8_t *)(0x4276358CUL))
#define bFM4_RTC_VBDOR_VDOR3                      *((volatile  uint8_t *)(0x4276358CUL))

