mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xn/common/mb9bf46xn.h
#define bFM_SDIF_PSWISTL_INT5MS                   *((volatile  uint8_t *)(0x42DC2300UL))
#define bFM4_SDIF_PSWISTL_INT5MS                  *((volatile  uint8_t *)(0x42DC2300UL))
#define bFM_SDIF_PSWISTL_INT1MS                   *((volatile  uint8_t *)(0x42DC2304UL))
#define bFM4_SDIF_PSWISTL_INT1MS                  *((volatile  uint8_t *)(0x42DC2304UL))

#define bFM_SDIF_SACMDEST_ACMD12NOEX              *((volatile  uint8_t *)(0x42DC0780UL))
#define bFM4_SDIF_SACMDEST_ACMD12NOEX             *((volatile  uint8_t *)(0x42DC0780UL))
#define bFM_SDIF_SACMDEST_ACMDTOERR               *((volatile  uint8_t *)(0x42DC0784UL))
#define bFM4_SDIF_SACMDEST_ACMDTOERR              *((volatile  uint8_t *)(0x42DC0784UL))
#define bFM_SDIF_SACMDEST_ACMDCRCERR              *((volatile  uint8_t *)(0x42DC0788UL))
#define bFM4_SDIF_SACMDEST_ACMDCRCERR             *((volatile  uint8_t *)(0x42DC0788UL))
#define bFM_SDIF_SACMDEST_ACMDEBERR               *((volatile  uint8_t *)(0x42DC078CUL))
#define bFM4_SDIF_SACMDEST_ACMDEBERR              *((volatile  uint8_t *)(0x42DC078CUL))
#define bFM_SDIF_SACMDEST_ACMDIDXERR              *((volatile  uint8_t *)(0x42DC0790UL))
#define bFM4_SDIF_SACMDEST_ACMDIDXERR             *((volatile  uint8_t *)(0x42DC0790UL))
#define bFM_SDIF_SACMDEST_CMDND12ERR              *((volatile  uint8_t *)(0x42DC079CUL))
#define bFM4_SDIF_SACMDEST_CMDND12ERR             *((volatile  uint8_t *)(0x42DC079CUL))

#define bFM_SDIF_SBLKGPCTL_BLCKGSTPREQ            *((volatile  uint8_t *)(0x42DC0540UL))
#define bFM4_SDIF_SBLKGPCTL_BLCKGSTPREQ           *((volatile  uint8_t *)(0x42DC0540UL))
#define bFM_SDIF_SBLKGPCTL_CONTREQ                *((volatile  uint8_t *)(0x42DC0544UL))
#define bFM4_SDIF_SBLKGPCTL_CONTREQ               *((volatile  uint8_t *)(0x42DC0544UL))
#define bFM_SDIF_SBLKGPCTL_RDWAITCTL              *((volatile  uint8_t *)(0x42DC0548UL))
#define bFM4_SDIF_SBLKGPCTL_RDWAITCTL             *((volatile  uint8_t *)(0x42DC0548UL))
#define bFM_SDIF_SBLKGPCTL_BLCKGAPINT             *((volatile  uint8_t *)(0x42DC054CUL))
#define bFM4_SDIF_SBLKGPCTL_BLCKGAPINT            *((volatile  uint8_t *)(0x42DC054CUL))

#define bFM_SDIF_SCLKCTL_INTLCLCKEN               *((volatile  uint8_t *)(0x42DC0580UL))
#define bFM4_SDIF_SCLKCTL_INTLCLCKEN              *((volatile  uint8_t *)(0x42DC0580UL))
#define bFM_SDIF_SCLKCTL_INTLCLCKST               *((volatile  uint8_t *)(0x42DC0584UL))
#define bFM4_SDIF_SCLKCTL_INTLCLCKST              *((volatile  uint8_t *)(0x42DC0584UL))
#define bFM_SDIF_SCLKCTL_SDCLCKEN                 *((volatile  uint8_t *)(0x42DC0588UL))
#define bFM4_SDIF_SCLKCTL_SDCLCKEN                *((volatile  uint8_t *)(0x42DC0588UL))
#define bFM_SDIF_SCLKCTL_CLCKGENSEL               *((volatile  uint8_t *)(0x42DC0594UL))
#define bFM4_SDIF_SCLKCTL_CLCKGENSEL              *((volatile  uint8_t *)(0x42DC0594UL))

#define bFM_SDIF_SCMMD_CMDCRCCHKE                 *((volatile  uint8_t *)(0x42DC01CCUL))
#define bFM4_SDIF_SCMMD_CMDCRCCHKE                *((volatile  uint8_t *)(0x42DC01CCUL))
#define bFM_SDIF_SCMMD_CMDIDXCHKE                 *((volatile  uint8_t *)(0x42DC01D0UL))
#define bFM4_SDIF_SCMMD_CMDIDXCHKE                *((volatile  uint8_t *)(0x42DC01D0UL))
#define bFM_SDIF_SCMMD_DATPRESSEL                 *((volatile  uint8_t *)(0x42DC01D4UL))
#define bFM4_SDIF_SCMMD_DATPRESSEL                *((volatile  uint8_t *)(0x42DC01D4UL))

#define bFM_SDIF_SEINTSGE_CMDTOERRG               *((volatile  uint8_t *)(0x42DC0740UL))
#define bFM4_SDIF_SEINTSGE_CMDTOERRG              *((volatile  uint8_t *)(0x42DC0740UL))
#define bFM_SDIF_SEINTSGE_CMDCRCERRG              *((volatile  uint8_t *)(0x42DC0744UL))
#define bFM4_SDIF_SEINTSGE_CMDCRCERRG             *((volatile  uint8_t *)(0x42DC0744UL))
#define bFM_SDIF_SEINTSGE_CMDEBERRG               *((volatile  uint8_t *)(0x42DC0748UL))
#define bFM4_SDIF_SEINTSGE_CMDEBERRG              *((volatile  uint8_t *)(0x42DC0748UL))
#define bFM_SDIF_SEINTSGE_CMDIDXERRG              *((volatile  uint8_t *)(0x42DC074CUL))
#define bFM4_SDIF_SEINTSGE_CMDIDXERRG             *((volatile  uint8_t *)(0x42DC074CUL))
#define bFM_SDIF_SEINTSGE_DTTOERRG                *((volatile  uint8_t *)(0x42DC0750UL))
#define bFM4_SDIF_SEINTSGE_DTTOERRG               *((volatile  uint8_t *)(0x42DC0750UL))
#define bFM_SDIF_SEINTSGE_DTCRCERRG               *((volatile  uint8_t *)(0x42DC0754UL))
#define bFM4_SDIF_SEINTSGE_DTCRCERRG              *((volatile  uint8_t *)(0x42DC0754UL))
#define bFM_SDIF_SEINTSGE_DTEBERRG                *((volatile  uint8_t *)(0x42DC0758UL))
#define bFM4_SDIF_SEINTSGE_DTEBERRG               *((volatile  uint8_t *)(0x42DC0758UL))
#define bFM_SDIF_SEINTSGE_CRTLMTERRG              *((volatile  uint8_t *)(0x42DC075CUL))
#define bFM4_SDIF_SEINTSGE_CRTLMTERRG             *((volatile  uint8_t *)(0x42DC075CUL))
#define bFM_SDIF_SEINTSGE_ACMD12ERRG              *((volatile  uint8_t *)(0x42DC0760UL))
#define bFM4_SDIF_SEINTSGE_ACMD12ERRG             *((volatile  uint8_t *)(0x42DC0760UL))
#define bFM_SDIF_SEINTSGE_ADMAERRG                *((volatile  uint8_t *)(0x42DC0764UL))
#define bFM4_SDIF_SEINTSGE_ADMAERRG               *((volatile  uint8_t *)(0x42DC0764UL))
#define bFM_SDIF_SEINTSGE_TUNINGERRG              *((volatile  uint8_t *)(0x42DC0768UL))
#define bFM4_SDIF_SEINTSGE_TUNINGERRG             *((volatile  uint8_t *)(0x42DC0768UL))
#define bFM_SDIF_SEINTSGE_BTACKERRG               *((volatile  uint8_t *)(0x42DC0770UL))
#define bFM4_SDIF_SEINTSGE_BTACKERRG              *((volatile  uint8_t *)(0x42DC0770UL))
#define bFM_SDIF_SEINTSGE_ACMD19ERRG              *((volatile  uint8_t *)(0x42DC0774UL))
#define bFM4_SDIF_SEINTSGE_ACMD19ERRG             *((volatile  uint8_t *)(0x42DC0774UL))
#define bFM_SDIF_SEINTSGE_AHBMSTERRG              *((volatile  uint8_t *)(0x42DC0778UL))
#define bFM4_SDIF_SEINTSGE_AHBMSTERRG             *((volatile  uint8_t *)(0x42DC0778UL))

#define bFM_SDIF_SEINTST_CMDTOERR                 *((volatile  uint8_t *)(0x42DC0640UL))
#define bFM4_SDIF_SEINTST_CMDTOERR                *((volatile  uint8_t *)(0x42DC0640UL))
#define bFM_SDIF_SEINTST_CMDCRCERR                *((volatile  uint8_t *)(0x42DC0644UL))
#define bFM4_SDIF_SEINTST_CMDCRCERR               *((volatile  uint8_t *)(0x42DC0644UL))
#define bFM_SDIF_SEINTST_CMDEBERR                 *((volatile  uint8_t *)(0x42DC0648UL))
#define bFM4_SDIF_SEINTST_CMDEBERR                *((volatile  uint8_t *)(0x42DC0648UL))
#define bFM_SDIF_SEINTST_CMDIDXERR                *((volatile  uint8_t *)(0x42DC064CUL))
#define bFM4_SDIF_SEINTST_CMDIDXERR               *((volatile  uint8_t *)(0x42DC064CUL))
#define bFM_SDIF_SEINTST_DTTOERR                  *((volatile  uint8_t *)(0x42DC0650UL))
#define bFM4_SDIF_SEINTST_DTTOERR                 *((volatile  uint8_t *)(0x42DC0650UL))
#define bFM_SDIF_SEINTST_DTCRCERR                 *((volatile  uint8_t *)(0x42DC0654UL))
#define bFM4_SDIF_SEINTST_DTCRCERR                *((volatile  uint8_t *)(0x42DC0654UL))
#define bFM_SDIF_SEINTST_DTEBERR                  *((volatile  uint8_t *)(0x42DC0658UL))
#define bFM4_SDIF_SEINTST_DTEBERR                 *((volatile  uint8_t *)(0x42DC0658UL))
#define bFM_SDIF_SEINTST_CRTLMTERR                *((volatile  uint8_t *)(0x42DC065CUL))
#define bFM4_SDIF_SEINTST_CRTLMTERR               *((volatile  uint8_t *)(0x42DC065CUL))
#define bFM_SDIF_SEINTST_ACMD12ERR                *((volatile  uint8_t *)(0x42DC0660UL))
#define bFM4_SDIF_SEINTST_ACMD12ERR               *((volatile  uint8_t *)(0x42DC0660UL))
#define bFM_SDIF_SEINTST_ADMAERR                  *((volatile  uint8_t *)(0x42DC0664UL))
#define bFM4_SDIF_SEINTST_ADMAERR                 *((volatile  uint8_t *)(0x42DC0664UL))
#define bFM_SDIF_SEINTST_TUNINGERR                *((volatile  uint8_t *)(0x42DC0668UL))
#define bFM4_SDIF_SEINTST_TUNINGERR               *((volatile  uint8_t *)(0x42DC0668UL))
#define bFM_SDIF_SEINTST_BTACKERR                 *((volatile  uint8_t *)(0x42DC0670UL))
#define bFM4_SDIF_SEINTST_BTACKERR                *((volatile  uint8_t *)(0x42DC0670UL))
#define bFM_SDIF_SEINTST_ACMD19ERR                *((volatile  uint8_t *)(0x42DC0674UL))
#define bFM4_SDIF_SEINTST_ACMD19ERR               *((volatile  uint8_t *)(0x42DC0674UL))
#define bFM_SDIF_SEINTST_AHBMSTERR                *((volatile  uint8_t *)(0x42DC0678UL))
#define bFM4_SDIF_SEINTST_AHBMSTERR               *((volatile  uint8_t *)(0x42DC0678UL))

#define bFM_SDIF_SEINTSTE_CMDTOERRS               *((volatile  uint8_t *)(0x42DC06C0UL))
#define bFM4_SDIF_SEINTSTE_CMDTOERRS              *((volatile  uint8_t *)(0x42DC06C0UL))
#define bFM_SDIF_SEINTSTE_CMDCRCERRS              *((volatile  uint8_t *)(0x42DC06C4UL))
#define bFM4_SDIF_SEINTSTE_CMDCRCERRS             *((volatile  uint8_t *)(0x42DC06C4UL))
#define bFM_SDIF_SEINTSTE_CMDEBERRS               *((volatile  uint8_t *)(0x42DC06C8UL))
#define bFM4_SDIF_SEINTSTE_CMDEBERRS              *((volatile  uint8_t *)(0x42DC06C8UL))
#define bFM_SDIF_SEINTSTE_CMDIDXERRS              *((volatile  uint8_t *)(0x42DC06CCUL))
#define bFM4_SDIF_SEINTSTE_CMDIDXERRS             *((volatile  uint8_t *)(0x42DC06CCUL))
#define bFM_SDIF_SEINTSTE_DTTOERRS                *((volatile  uint8_t *)(0x42DC06D0UL))
#define bFM4_SDIF_SEINTSTE_DTTOERRS               *((volatile  uint8_t *)(0x42DC06D0UL))
#define bFM_SDIF_SEINTSTE_DTCRCERRS               *((volatile  uint8_t *)(0x42DC06D4UL))
#define bFM4_SDIF_SEINTSTE_DTCRCERRS              *((volatile  uint8_t *)(0x42DC06D4UL))
#define bFM_SDIF_SEINTSTE_DTEBERRS                *((volatile  uint8_t *)(0x42DC06D8UL))
#define bFM4_SDIF_SEINTSTE_DTEBERRS               *((volatile  uint8_t *)(0x42DC06D8UL))
#define bFM_SDIF_SEINTSTE_CRTLMTERRS              *((volatile  uint8_t *)(0x42DC06DCUL))
#define bFM4_SDIF_SEINTSTE_CRTLMTERRS             *((volatile  uint8_t *)(0x42DC06DCUL))
#define bFM_SDIF_SEINTSTE_ACMD12ERRS              *((volatile  uint8_t *)(0x42DC06E0UL))
#define bFM4_SDIF_SEINTSTE_ACMD12ERRS             *((volatile  uint8_t *)(0x42DC06E0UL))
#define bFM_SDIF_SEINTSTE_ADMAERRS                *((volatile  uint8_t *)(0x42DC06E4UL))
#define bFM4_SDIF_SEINTSTE_ADMAERRS               *((volatile  uint8_t *)(0x42DC06E4UL))
#define bFM_SDIF_SEINTSTE_TUNINGERRS              *((volatile  uint8_t *)(0x42DC06E8UL))
#define bFM4_SDIF_SEINTSTE_TUNINGERRS             *((volatile  uint8_t *)(0x42DC06E8UL))
#define bFM_SDIF_SEINTSTE_BTACKERRS               *((volatile  uint8_t *)(0x42DC06F0UL))
#define bFM4_SDIF_SEINTSTE_BTACKERRS              *((volatile  uint8_t *)(0x42DC06F0UL))
#define bFM_SDIF_SEINTSTE_ACMD19ERRS              *((volatile  uint8_t *)(0x42DC06F4UL))
#define bFM4_SDIF_SEINTSTE_ACMD19ERRS             *((volatile  uint8_t *)(0x42DC06F4UL))
#define bFM_SDIF_SEINTSTE_AHBMSTERRS              *((volatile  uint8_t *)(0x42DC06F8UL))
#define bFM4_SDIF_SEINTSTE_AHBMSTERRS             *((volatile  uint8_t *)(0x42DC06F8UL))

